async def analysis(last):
    res = 0
    count = 0
    for i in last:
        if i == "good":
            count += 1
            res += 3
        if i == "bad":
            count += 1
            res += 1
        if i == "normal":
            count += 1
            res += 2
    try:
        result = round(res / count)
        print(result)
    except ZeroDivisionError:
        return None

    if result == 1:
        return ("\n\n📈 Самочувствие на основе ваших оценок:\n"
                "Сегодня возможен дискомфорт и снижение тонуса. Рекомендуется беречь силы и уделить внимание отдыху.")
    elif result == 2:
        return ("\n\n📈 Самочувствие на основе ваших оценок:\n"
                "Сегодня вы будете чувствовать себя нормально, без резких перепадов. "
                "Можно спокойно заниматься привычными делами.")
    elif result == 3:
        return ("\n\n📈 Самочувствие на основе ваших оценок:\n"
                "Сегодня вы будете чувствовать себя отлично, день пройдёт легко и продуктивно. Можно смело планировать активные дела и наслаждаться днём.")
    else:
        return None